In [1]:
# Importing pandas
import pandas as pd

# Reading CSV file containing data into a Dataframe
bank_loans = pd.read_csv("raw_data/Bank_Personal_Loan_Modelling.csv")

# Displays first few rows of dataframe to show column names
bank_loans.head()

,ID,Age,Experience,Income,ZIP Code,Family,CCAvg,Education,Mortgage,Personal Loan,Securities Account,CD Account,Online,CreditCard
0,1,25,1,49,91107,4,1.6,1,0,0,1,0,0,0
1,2,45,19,34,90089,3,1.5,1,0,0,1,0,0,0
2,3,39,15,11,94720,1,1.0,1,0,0,0,0,0,0
3,4,35,9,100,94112,1,2.7,2,0,0,0,0,0,0
4,5,35,8,45,91330,4,1.0,2,0,0,0,0,0,1

In [2]:
# Narrowing columns in the data frame for our use (can be adjusted if need be)
bank_loans = bank_loans[['Age', 'Experience', 'Income', 'ZIP Code', 'Family', 'CCAvg',
                         'Education', 'Mortgage', 'Personal Loan']]

# Displaying reduced dataframe
bank_loans.head()

,Age,Experience,Income,ZIP Code,Family,CCAvg,Education,Mortgage,Personal Loan
0,25,1,49,91107,4,1.6,1,0,0
1,45,19,34,90089,3,1.5,1,0,0
2,39,15,11,94720,1,1.0,1,0,0
3,35,9,100,94112,1,2.7,2,0,0
4,35,8,45,91330,4,1.0,2,0,0

In [3]:
# Checking data types of each column
bank_loans.dtypes

Age                int64
Experience         int64
Income             int64
ZIP Code           int64
Family             int64
CCAvg            float64
Education          int64
Mortgage           int64
Personal Loan      int64
dtype: object

In [4]:
# Converts education column to type string
bank_loans = bank_loans.astype({"Education": 'str'})

# Clarifies what each value in the education category stands for
bank_loans["Education"] = bank_loans["Education"].replace({"1": "Undergrad", "2": "Graduate",
                                                          "3": "Advanced/Professional"})

In [5]:
# Converts personal loan column to type string
bank_loans = bank_loans.astype({"Personal Loan": 'str'})

# Clarifies what each value in the personal loan category stands for
bank_loans["Personal Loan"] = bank_loans["Personal Loan"].replace({"0": "No", "1": "Yes"})

In [6]:
# Pull out the income column into a series and converts to type string
income = bank_loans["Income"].astype('str')

# Adds 3 zeros to each value in income
income = [x + "000" for x in income]

# Converts income back to int
income = [int(x) for x in income]

# Overwrites the bank loan dataframe with the updated income column
bank_loans["Income"] = income

# Checks the dataframe
bank_loans.head()

,Age,Experience,Income,ZIP Code,Family,CCAvg,Education,Mortgage,Personal Loan
0,25,1,49000,91107,4,1.6,Undergrad,0,No
1,45,19,34000,90089,3,1.5,Undergrad,0,No
2,39,15,11000,94720,1,1.0,Undergrad,0,No
3,35,9,100000,94112,1,2.7,Graduate,0,No
4,35,8,45000,91330,4,1.0,Graduate,0,No

In [7]:
# Pull out the mortgage column into a series and converts to type string
mortgage = bank_loans["Mortgage"].astype('str')

# Adds 3 zeros to each value in mortgage
mortgage = [x + "000" for x in mortgage]

# Converts mortgage back to int, removes extra zeros from people who don't have a mortage also
mortgage = [int(x) for x in mortgage]

# Overwrites the bank loan dataframe with the updated mortgage column
bank_loans["Mortgage"] = mortgage

# Checks the dataframe
bank_loans.head()

,Age,Experience,Income,ZIP Code,Family,CCAvg,Education,Mortgage,Personal Loan
0,25,1,49000,91107,4,1.6,Undergrad,0,No
1,45,19,34000,90089,3,1.5,Undergrad,0,No
2,39,15,11000,94720,1,1.0,Undergrad,0,No
3,35,9,100000,94112,1,2.7,Graduate,0,No
4,35,8,45000,91330,4,1.0,Graduate,0,No

In [8]:
# Makes sure each value in CCAvg has 3 decimal places
bank_loans["CCAvg"] = bank_loans["CCAvg"].map('{:,.3f}'.format)

# Converts CCAvg column to type string
ccavg = bank_loans["CCAvg"].astype('str')

# Removes the decimal in each row to convert value from thousands to normal
ccavg = [x.replace(".", "") for x in ccavg]

# Converts the list into type int
ccavg = [int(x) for x in ccavg]

# Overwrites the CCAvg column in bank loans dataframe with new formatting
bank_loans["CCAvg"] = ccavg

# Checks the dataframe
bank_loans.head()

,Age,Experience,Income,ZIP Code,Family,CCAvg,Education,Mortgage,Personal Loan
0,25,1,49000,91107,4,1600,Undergrad,0,No
1,45,19,34000,90089,3,1500,Undergrad,0,No
2,39,15,11000,94720,1,1000,Undergrad,0,No
3,35,9,100000,94112,1,2700,Graduate,0,No
4,35,8,45000,91330,4,1000,Graduate,0,No